Revit 2027 API
MEPSystemType.CalculationLevel Property
 Identifies the calculation level for the system type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SystemCalculationLevel CalculationLevel { get; set; }
Public Property CalculationLevel As SystemCalculationLevel
	Get
	Set
public:
property SystemCalculationLevel CalculationLevel {
	SystemCalculationLevel get ();
	void set (SystemCalculationLevel value);
}
member CalculationLevel : SystemCalculationLevel with get, set
Property Value
SystemCalculationLevel
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace